
export  const steps = [
  {
    selector: '.progress',
    content:
        'По мере выполнения заданий, твой прогресс будет расти. Чем больше заданий ты решишь верно — тем выше будет % твоего прогресса. Всё просто!',
  },
  {
    selector: '.homePublicPage__block',
    content:
        'Здесь ты можешь ознакомиться с заданиями, они будут высвечиваться по одному. Перейти к следующему ты сможешь, когда решишь текущее. Внимательно читай, что нужно сделать, большинство ошибок - чаще по невнимательности, чем от глупости.',
  },
  {
    selector: '.homePublicPage__exercise-a',
    content:
        'После знакомства с этим гайдом, мы обязательно проведем тебе небольшой экскурс, о том, что такое тэги и из чего состоят веб-страницы. Если вдруг ты захочешь вернуться к этой теории, ты всегда сможешь это сделать в этом разделе. ',
  },
  {
    selector: '.homePublicPage__answer',
    content: 'Это редактор. Сюда тебе нужно будет написать свое решение. ',
  },
  {
    selector: '.homePublicPage__result',
    content:
        'В этом поле ты увидишь "чистый" результат того, что ты написала в редакторе. Проще говоря, в редакторе будет HTML-разметка, а здесь - то же самое, но уже бэз тэгов, на языке людей, а не программистов :) .',
  },

  {
    selector: '.homePublicPage__hint-btn',
    content:
        'Если решение никак не дается, мы подскажем его! После 3ех неправильных ответов, вот здесь у тебя появится "лампочка". Ты сможешь нажать на нее и увидеть ответ. Но постарайся прибегать к этому инструменту как можно реже, ведь в реальных задачах готового решения может и не быть! ',
  },
  {
    selector: '.homePublicPage__check',
    content:
        'Наконец, кнопка "Проверить" скажет тебе, верно ли ты решила задание. Просто нажми и узнай результат! Вот и всё, теперь ты готова начать! Желаем тебе удачи, у тебя точно получится! ',
  },
];
